Repository: mayWeMeetAgain11/fultter-sellpoint
Catalog: lib/l10n/intl_*.arb
Languages: ar

# startDayTitle
source: Start Page
ar: صفحة البدء

# startDayDescription
source: start our step
ar: ابدأ الخطوة الأولى

# homePageTitle
source: Home Page
ar: الصفحة الرئيسية

# homeBottomSells
source: sells
ar: المبيعات

# homeBottomSellsDescription
source: sells your items
ar: بيع منتجاتك

# homeBottomBills
source: bills
ar: الفواتير

# homeBottomBillsDescription
source: order and show your bills
ar: قم بإنشاء وعرض الفواتير

# homeBottomEndDay
source: End Day process
ar: اجراءات نهاية اليوم

# homeBottomEndDayDescription
source: enter the final amount and inventory your items
ar: أدخل المبلغ النهائي وقم بفحص المخزون

# salePageTitle
source: Sales Page
ar: صفحة المبيعات

# saleBottomOnline
source: Online
ar: استخدام الإنترنت

# saleBottomOnlineDescription
source: must exist the internet
ar: يجب أن يكون هناك اتصال بالإنترنت

# saleBottomOffline
source: Offline
ar: عدم استخدام الإنترنت

# saleBottomOfflineDescription
source: the first step need internet, then sell offline
ar: الخطوة الأولى تتطلب اتصالًا بالإنترنت ثم يمكن البيع بدون اتصال

# billPageTitle
source: bills page
ar: صفحة الفواتير

# billBottomShowYourBills
source: show your bills
ar: عرض الفواتير

# billBottomShowYourBillsDescription
source: show your orders
ar: عرض الطلبات الخاصة بك

# billBottomOrder
source: order the bill
ar: طلب فاتورة

# billBottomOrderFromFactoryDescription
source: order now
ar: اطلب الآن

# billBottomOrderFromSp
source: order the bill from another sp
ar: طلب فاتورة من موزع آخر

# billBottomOrderFromSpDescription
source: order from near sp
ar: اطلب من موزع قريب

# billBottomShowAnotherSpOrder
source: another sp orders
ar: طلبات الموزعين الآخرين

# billBottomShowAnotherSpOrderDescription
source: SPs that order from you
ar: موزعين آخرون يطلبون منك

# showYourBillsTitle
source: Show Your orders Page
ar: صفحة عرض الطلبات

# showYourBillsId
source: ID
ar: المعرف

# showYourBillsDate
source: Date
ar: التاريخ

# showYourBillsBottomFromFactory
source: from factory
ar: من المصنع

# showYourBillsBottomFromSp
source: from SP
ar: من الموزع

# showYourBillsBottomDetails
source: details
ar: تفاصيل

# orderFromFactoryTitle
source: order from factory
ar: طلب من المصنع

# orderFromFactoryPrice
source: price
ar: السعر

# orderFromFactoryQuantity
source: Quantity
ar: الكمية

# orderFromFactoryChooseSP
source: choose SP
ar: اختيار الموزع

# orderFromFactorySPChoosen
source: SP Choosen
ar: الموزع المختار

source: post
ar: ارسال

# orderFromSpTitle
source: order from SP
ar: طلب من موزع آخر

# showAnotherSpOrderTitle
source: Show Another Sp Order Page
ar: صفحة طلبات موزع آخر

# showAnotherSpOrderFromSp
source: from sp
ar: من الموزع

# endDayTitle
source: EndDay Page
ar: صفحة انهاء اليوم

# endDayAddress
source: address of the envelope
ar: عنوان الظرف

# endDayAddressField
source: enter the address
ar: أدخل العنوان

# endDayAmount
source: amount inside the envelope
ar: المبلغ في الظرف

# endDayAmountField
source: enter the amount
ar: أدخل المبلغ

# endDayInventory
source: Inventory
ar: المخزون

# endDayItemName
source: Item Name
ar: اسم الصنف

# endDayQuantity
source: Remaining quantity
ar: الكمية المتبقية

# endDaytaken
source: Quantity taken
ar: كمية العنيات

# endDaySold
source: Quantity Sold
ar: الكمية المباعة

# endDayHintText
source: enter the Remaining quantity
ar: أدخل الكمية المتبقية

# endDaytakenHintText
source: enter the Quantity taken
ar: ادخل الكمية المأخوذة

# endDaySoldHintText
source: enter the Quantity Sold
ar: ادخل الكمية المباعة

# loginTitle
source: Wellcome
ar: مرحباً

# loginSubTitle
source: Please login with your information
ar: يرجى تسجيل الدخول باستخدام معلوماتك

# loginUserName
source: User Name
ar: إسم المستخدم

# loginPassword
source: Password
ar: كلمة السر

# loginLogin
source: LOGIN
ar: تسجيل الدخول

# loginValidateMessage
source: Please enter data
ar: الرجاء إدخال البيانات

# errorMessegeInPostBill
source: you can't send your bill
ar: خطأ, لا يمكنك ارسال الفاتورة

source: choose student
ar: إختر الطالب

source: ok
ar: موافق

# alertPostDialog
source: please Choose Sell point, or check for your order list
ar: الرجاء اختيار نقطة بيع, أو تأكد من قائمة الطلبات

source: cancel
ar: إلغاء

# threshold
source: Daily limit
ar: الحد اليومي

source: balance
ar: المبلغ الكلي

# thereIsAnError
source: there is an error, please try again
ar: يوجد خطأ, يرجى المحاولة مرة أخرى

source: Total:
ar: المجموع الكلي:

# MainTitle
source: Sell Point Account
ar: حساب نقطة بيع

# connectionTimeout
source: Connection timeout with ApiServer
ar: انتهى زمن الإتصال مع الخادم

# sendTimeout
source: Send timeout with ApiServer
ar: انتهى زمن الإرسال, يرجى المحاولة مرة اخرى

# receiveTimeout
source: Receive timeout with ApiServer
ar: إنتهى زمن الإستقبال, يرجى المحاولة مرة اخرى

# badResponse400_13
source: bad response
ar: خطأ في الإستجابة

# badResponse404
source: Your requesst not found, Please try later!
ar: طلب الخادم غير موجود, يرجى المحاولة مرة اخرى

# badResponse500
source: internal Server error, Please try later
ar: خطأ في الخادم, يرجى المحاولة مرة اخرى

# badResponse
source: Opps There was an Error, Please try again
ar: هناك خطأ, حاول مرة اخرى

# cancelRequest
source: Request to ApiServer was canceld
ar: تم إلغاء الطلب

# UnecpectedError
source: Unecpected Error, Please try later!
ar: خطأ غير متوقع, تأكد من اتصال الانترنت

# errorDialogItem
source: Please select an item
ar: الرجاء اختيار عنصر

# errorDialogStudent
source: Please select a student
ar: الرجاء تحديد طالب

# errorDialogBalance
source: Daily limit or balance is not enough
ar: الحد اليومي أو الرصيد لا يكفي

# endDayDialog
source: There is local data, upload it to the server and then inventory the items
ar: هناك بيانات محلية , ارفعها للخادم ثم اجرد العناصر

source: charge
ar: اشحن

# spNameInshowyourBill
source: SP Name
ar: اسم نقطة البيع

# uploadBottonTitle
source: Upload students data
ar: ارسل طلبات الطلاب

# uploadBottonDescription
source: upload offline students order
ar: ارسل الطلبات المخزنة بدون انترنت

# chargeScanBotton
source: Click here to select a student
ar: اضغط هنا لإختيار الطالب

source: scan
ar: امسح

source: inter amount
ar: ادخل الكمية

source: Recharge student cards
ar: شحن بطاقات الطلاب

source: Recharge by QR
ar: اشحن عن طريق الماسح الضوئي

# alertChargeDialog1
source: Are you sure about the recharge process?
ar: هل انت متأكد من عملية شحن الرصيد؟

# alertChargeDialog2
source: You did't choose the student or the amount
ar: لم تحدد الطالب أو لم تحدد الكمية

# uploadPageMessage
source: there is no local data to upload
ar: لا توجد بيانات طلاب محلية للرفع للخادم

source: there is no student choosen
ar: لم تقم بإختيار طالب

source: Rest of the daily limit
ar: الباقي من الحد اليومي

# aleartDialogOfOrder
source: Attention, you have requested an invoice in advance.Are you sure to send this invoice instead of those?
ar: انتبه,لقد قمت بطلب فاتورة مسبقة.هل أنت متأكد من ارسال هذه الفاتورة بدلا من تلك؟

source: amount taken
ar: مبلغ العينات

# exit
source: do you want to log out from app??
ar: هل تريد تسجيل الخروج من التطبيق؟

source: Choose an order type
ar: إختر نوع الطلبية

source: Food Order
ar: طلبية أطعمة

source: Raw materials order
ar: طلبية مواد أولية

source: there is No data
ar: لا يوجد بيانات

# returnOrder
source: returns Order
ar: طلبية مرتجعات

source: expenses order
ar: طلبية عينات

source: external order
ar: طلبية خارجية

source: search
ar: إبحث

source: choose date
ar: إختر تاريخ
